const apd = function(x,y){
    return(x+y);
}
// ปกติจะต้องประกาศคำว่า function ขึ้นมาก่อน

const add = (x,y) =>{
    return x+y;
};
// เราสามารถลดรูปมันได้โดยใช้แค่ =>

const ffd = x =>{
    return x*x;
}
// หรือไม่ต้องมี () ก็ได้ แต่ได้แค่กรณี ตัวแปรเดียว

const klmm = () =>{
    return console.log(`d`);
};
// หากไม่มีตัวแปรจำเป็ฯต้องใส่ () ว่างไว้ด้วย


const klmmd = () =>(
    console.log(`d`)
);
// สามารถลดรูปการ return โดยไม่ต้องมี return ได้ โดยการเปลี่ยนจาก {} เป็น ()
// แต่จะสามารถใช้ได้แค่บรรทัดเดียว ถ้ามี2บรรทัด จะ error
const klmmda = (a,b) => a+b;
// หรือไม้ต้องใส่ () ,{} ก็ได้ 